ZeroZap/xhsc/HC32L021/driver/src/hc32l021_rtc.c
/**
 *******************************************************************************
 * @file  rtc.c
 * @brief This file provides firmware functions to manage the RTC
 @verbatim
   Change Logs:
   Date             Author          Notes
   2024-11-18       MADS            First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2024, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32l021_rtc.h"
#include "math.h"

/**
 * @addtogroup HC32L021_DDL 驱动库
 * @{
 */

/**
 * @defgroup DDL_RTC RTC模块驱动库
 * @brief RTC Driver Library RTC模块驱动库
 * @{
 */
/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup RTC_Local_Macros RTC局部宏定义
 * @{
 */
/**
 * @defgroup RTC_WPR_Value RTC WPR Value definition RTC WPR保护序列
 * @{
 */
#define RTC_UNLOCK_VALUE1 (0xCAu) /*!< 写入序列0xCA,0x53解锁 */
#define RTC_UNLOCK_VALUE2 (0x53u) /*!< 写入序列0xCA,0x53解锁 */
#define RTC_LOCK_VALUE    (0xFFu) /*!< 写入其他序列锁定寄存器写，除了WPR与ICR */
/**
 * @}
 */

/**
 * @defgroup RTC_Timeout RTC超时时间
 * @{
 */
#define RTC_TIMEOUT (0xFFFFu)
/**
 * @}
 */

/**
 * @}
 */
/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/
/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/
/******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/
/**
 * @defgroup RTC_Local_Variables RTC局部变量定义
 * @{
 */
/**
 * @brief  平年每个月最后一天日期表 BCD格式
 */
const static uint8_t au8CommonYearMonthEndDates[12] = {0x31, 0x28, 0x31, 0x30, 0x31, 0x30, 0x31, 0x31, 0x30, 0x31, 0x30, 0x31};
/**
 * @}
 */
/******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/
/**
 * @addtogroup RTC_Local_Functions RTC局部函数定义
 * @{
 */
static en_result_t RTC_CheckBCDFormat(uint8_t u8Data, uint8_t u8Min, uint8_t u8Max);
static boolean_t   RTC_IsLeapYear(uint8_t u8Year);
/**
 * @}
 */
/*****************************************************************************
 * Function implementation - global ('extern') and local ('static')
 *****************************************************************************/
/**
 * @defgroup RTC_Local_Functions RTC局部函数定义
 * @{
 */

/**
 * @brief  BCD格式检查
 * @param  [in] u8Data BCD带检查数
 * @param  [in] u8Min BCD最小值
 * @param  [in] u8Max BCD最大值
 * @retval en_result_t
 *           - Ok: BCD格式正确
 *           - Error: BCD格式错误
 */
static en_result_t RTC_CheckBCDFormat(uint8_t u8Data, uint8_t u8Min, uint8_t u8Max)
{
    if (((u8Data & 0x0Fu) > 0x09u) || ((u8Data & 0xF0u) > 0x90u) || (u8Data > u8Max) || (u8Data < u8Min))
    {
        return Error;
    }
    return Ok;
}

/**
 * @brief  闰年判断
 * @param  [in] u8Year 2000年后的年份的十位和个位0~99
 * @retval boolean_t
 *           - TRUE: 是闰年
 *           - FALSE: 不是闰年
 */
static boolean_t RTC_IsLeapYear(uint8_t u8Year)
{
    uint16_t u16Year;
    u16Year = 2000u + u8Year;

    return (((u16Year % 4u == 0u) && (u16Year % 100u != 0u)) || (u16Year % 400u == 0u)) ? TRUE : FALSE;
}
/**
 * @}
 */
/*****************************************************************************
 * Function implementation - global ('extern') and local ('static')
 *****************************************************************************/
/**
 * @defgroup RTC_Global_Functions RTC全局函数定义
 * @{
 */

/**
 * @brief  RTC初始化
 * @param  [in] pstcRtcInit 初始化结构体指针 @ref stc_rtc_init_t
 * @retval en_result_t
 *           - Ok: 设置初始时间成功
 *           - Error: 设置初始时间失败
 */
en_result_t RTC_Init(stc_rtc_init_t *pstcRtcInit)
{
    CLR_REG32_BIT(RTC->CR0, RTC_CR0_START_Msk);                                /* 计数停止 */
    MODIFY_REG32(RTC->CR0, RTC_CR0_AMPM_Msk, (uint32_t)pstcRtcInit->u8Format); /* 实时时钟小时的时制 */
    MODIFY_REG32(RTC->CR1, RTC_CR1_CKSEL_Msk, pstcRtcInit->u32ClockSelect);    /* 实时时钟RTC的时钟源 */

    if (Ok == RTC_DateTimeSet(&pstcRtcInit->stcRtcTime)) /* 设置初始时间 */
    {
        SET_REG32_BIT(RTC->CR0, RTC_CR0_START_Msk); /* 计数开始 */
        return Ok;
    }
    else
    {
        return Error;
    }
}

/**
 * @brief  RTC写保护寄存器解锁
 * @retval None
 */
void RTC_Unlock(void)
{
    WRITE_REG32(RTC->WPR, RTC_UNLOCK_VALUE1);
    WRITE_REG32(RTC->WPR, RTC_UNLOCK_VALUE2);
}

/**
 * @brief  RTC写保护寄存器锁定
 * @retval None
 */
void RTC_Lock(void)
{
    WRITE_REG32(RTC->WPR, RTC_UNLOCK_VALUE1);
    WRITE_REG32(RTC->WPR, RTC_LOCK_VALUE);
}

/**
 * @brief  RTC使能
 * @retval None
 */
void RTC_Enable(void)
{
    SET_REG32_BIT(RTC->CR0, RTC_CR0_START_Msk);
}

/**
 * @brief  RTC禁止
 * @retval None
 */
void RTC_Disable(void)
{
    CLR_REG32_BIT(RTC->CR0, RTC_CR0_START_Msk);
}

/**
 * @brief  RTC计数器启动等待函数
 * @note   如启动RTC计数器后立即进入低功耗模式，进入低功耗模式之前需执行此函数，以确保RTC已启动完成
 * @retval en_result_t
 *           - Ok: 写入成功
 *           - ErrorTimeout: 操作超时
 */
en_result_t RTC_StartWait(void)
{
    uint32_t u32Timeout;

    SET_REG32_BIT(RTC->CR1, RTC_CR1_WAIT_Msk);

    u32Timeout = RTC_TIMEOUT;
    while (RTC_CR1_WAITF_Msk != READ_REG32_BIT(RTC->CR1, RTC_CR1_WAITF_Msk)) /* 等待直到WAITF=1 */
    {
        if (0x0u == u32Timeout--)
        {
            return ErrorTimeout;
        }
    }

    CLR_REG32_BIT(RTC->CR1, RTC_CR1_WAIT_Msk);

    u32Timeout = RTC_TIMEOUT;
    while (RTC_CR1_WAITF_Msk == READ_REG32_BIT(RTC->CR1, RTC_CR1_WAITF_Msk)) /* 等待直到WAITF=0 */
    {
        if (0x0u == u32Timeout--)
        {
            return ErrorTimeout;
        }
    }

    return Ok;
}

/**
 * @brief  1Hz输出使能
 * @retval None
 */
void RTC_1HzEnable(void)
{
    SET_REG32_BIT(RTC->CR0, RTC_CR0_HZ1OE_Msk);
}

/**
 * @brief  1Hz输出禁止
 * @retval None
 */
void RTC_1HzDisable(void)
{
    CLR_REG32_BIT(RTC->CR0, RTC_CR0_HZ1OE_Msk);
}

/**
 * @brief  1Hz输出精度配置
 * @param  [in] u32Pricision  @ref RTC_1Hz_Pricision_Select
 * @retval None
 */
void RTC_1HzConfig(uint32_t u32Pricision)
{
    MODIFY_REG32(RTC->CR0, RTC_CR0_HZ1SEL_Msk, u32Pricision);
}

/**
 * @brief  设置周期中断的类型(PRDSEL)及其所选类型的时间(PRDS或PRDX)
 * @param  [in] pstcPrd 根据结构体的定义设置PRDSEL、PRDS与PRDX @ref stc_rtc_prd_t
 * @note   设置产生周期中断的时间间隔PRDX，可设定的范围为0~63，对应0.5秒到32秒，步进为0.5秒
 * @retval en_result_t
 *           - Ok: 设置成功
 *           - ErrorInvalidParameter: 参数错误
 */
en_result_t RTC_PrdConfig(stc_rtc_prd_t *pstcPrd)
{
    en_result_t enRet = Ok;
    MODIFY_REG32(RTC->CR0, RTC_CR0_PRDSEL_Msk, pstcPrd->u32PrdSelect);

    if (pstcPrd->u32PrdSelect == RTC_PRDSEL_PRDS)
    {
        MODIFY_REG32(RTC->CR0, RTC_CR0_PRDS_Msk, pstcPrd->u32Prds);
    }
    else if (pstcPrd->u32PrdSelect == RTC_PRDSEL_PRDX)
    {
        if (pstcPrd->u8Prdx >= 64u)
        {
            enRet = ErrorInvalidParameter;
            return enRet;
        }
        MODIFY_REG32(RTC->CR0, RTC_CR0_PRDX_Msk, (uint32_t)pstcPrd->u8Prdx << RTC_CR0_PRDX_Pos);
    }
    else
    {
        enRet = ErrorInvalidParameter;
    }
    return enRet;
}

/**
 * @brief  闹钟使能
 * @param  [in] u32AlarmX 闹钟选择闹钟A或者闹钟B @ref RTC_Alarm_Channel_Select
 * @retval None
 */
void RTC_AlarmEnalbe(uint32_t u32AlarmX)
{
    if (RTC_ALM_CHA == u32AlarmX)
    {
        SET_REG32_BIT(RTC->CR2, RTC_CR2_ALMAE_Msk);
    }
    else if (RTC_ALM_CHB == u32AlarmX)
    {
        SET_REG32_BIT(RTC->CR2, RTC_CR2_ALMBE_Msk);
    }
    else
    {
        ;
    }
}

/**
 * @brief  闹钟禁止
 * @param  [in] u32AlarmX 闹钟选择闹钟A或者闹钟B @ref RTC_Alarm_Channel_Select
 * @retval None
 */
void RTC_AlarmDisalbe(uint32_t u32AlarmX)
{
    if (RTC_ALM_CHA == u32AlarmX)
    {
        CLR_REG32_BIT(RTC->CR2, RTC_CR2_ALMAE_Msk);
    }
    else if (RTC_ALM_CHB == u32AlarmX)
    {
        CLR_REG32_BIT(RTC->CR2, RTC_CR2_ALMBE_Msk);
    }
    else
    {
        ;
    }
}

/**
 * @brief  RTC闹钟时间获取
 * @param  [in] u32AlarmX 闹钟选择闹钟A或者闹钟B @ref RTC_Alarm_Channel_Select
 * @param  [in] pstcAlarmTime 存放闹钟时间寄存器数据：秒 分 时 周 秒屏蔽 分屏蔽 时屏蔽 @ref stc_rtc_alarmtime_t
 * @retval None
 */
void RTC_AlarmTimeGet(uint32_t u32AlarmX, stc_rtc_alarmtime_t *pstcAlarmTime)
{
    uint32_t u32RegAddr;
    uint8_t  u8Hour;

