ZeroZap/xhsc/HC32L021/driver/src/hc32l021_rtc.c
    if (RTC_ALM_CHA == u32AlarmX)
    {
        u32RegAddr = (uint32_t)&RTC->ALMA;
    }
    else
    {
        u32RegAddr = (uint32_t)&RTC->ALMB;
    }

    pstcAlarmTime->u8AlarmSecond    = (uint8_t)(((*(uint32_t *)u32RegAddr) & (RTC_ALMA_SECL_Msk | RTC_ALMA_SECH_Msk)) >> RTC_ALMA_SECL_Pos);
    pstcAlarmTime->u8AlarmMinute    = (uint8_t)(((*(uint32_t *)u32RegAddr) & (RTC_ALMA_MINL_Msk | RTC_ALMA_MINH_Msk)) >> RTC_ALMA_MINL_Pos);
    u8Hour                          = (uint8_t)(((*(uint32_t *)u32RegAddr) & (RTC_ALMA_HOURL_Msk | RTC_ALMA_HOURH_Msk)) >> RTC_ALMA_HOURL_Pos);
    pstcAlarmTime->u8AlarmDayOfWeek = (uint8_t)(((*(uint32_t *)u32RegAddr) & RTC_ALMA_WEEK_Msk) >> RTC_ALMA_WEEK_Pos);
    pstcAlarmTime->bAlarmMskHour    = ((*(uint32_t *)u32RegAddr) & RTC_ALMA_MSKH_Msk) ? TRUE : FALSE;
    pstcAlarmTime->bAlarmMskMinute  = ((*(uint32_t *)u32RegAddr) & RTC_ALMA_MSKM_Msk) ? TRUE : FALSE;
    pstcAlarmTime->bAlarmMskSecond  = ((*(uint32_t *)u32RegAddr) & RTC_ALMA_MSKS_Msk) ? TRUE : FALSE;

    if (RTC_FMT_24H == READ_REG32_BIT(RTC->CR0, RTC_CR0_AMPM_Msk))
    {
        pstcAlarmTime->u8AlarmHour = u8Hour;
    }
    else
    {
        pstcAlarmTime->u8AlarmHour = u8Hour & 0x1Fu;
        pstcAlarmTime->u8AmPm      = (u8Hour & 0x20u) ? 1u : 0u;
    }
}

/**
 * @brief  RTC闹钟设置
 * @param  [in] u32AlarmX 闹钟选择闹钟A或者闹钟B @ref RTC_Alarm_Channel_Select
 * @param  [in] pstcAlarmTime 存放闹钟时间寄存器数据：秒 分 时 周 秒屏蔽 分屏蔽 时屏蔽 @ref stc_rtc_alarmtime_t
 * @retval en_result_t
 *         - Ok: 设置完成
 *         - ErrorInvalidParameter: 设置失败，时间BCD格式不符合
 */
en_result_t RTC_AlarmTimeSet(uint32_t u32AlarmX, stc_rtc_alarmtime_t *pstcAlarmTime)
{
    en_result_t enRet = Ok;

    uint32_t u32RegValue;
    uint32_t u32Hour;

    if (Ok != RTC_CheckBCDFormat(pstcAlarmTime->u8AlarmSecond, 0x00u, 0x59u))
    {
        return ErrorInvalidParameter;
    }
    if (Ok != RTC_CheckBCDFormat(pstcAlarmTime->u8AlarmMinute, 0x00u, 0x59u))
    {
        return ErrorInvalidParameter;
    }

    if (RTC_FMT_24H == READ_REG32_BIT(RTC->CR0, RTC_CR0_AMPM_Msk))
    {
        enRet   = RTC_CheckBCDFormat(pstcAlarmTime->u8AlarmHour, 0x00u, 0x23u); /* 24H */
        u32Hour = pstcAlarmTime->u8AlarmHour;
    }
    else
    {
        enRet   = RTC_CheckBCDFormat(pstcAlarmTime->u8AlarmHour & (~0x20u), 0x01u, 0x12u); /* 12H */
        u32Hour = pstcAlarmTime->u8AmPm ? (pstcAlarmTime->u8AlarmHour | 0x20u) : pstcAlarmTime->u8AlarmHour;
    }
    if (Ok != enRet)
    {
        return ErrorInvalidParameter;
    }

    u32RegValue = (((uint32_t)pstcAlarmTime->u8AlarmSecond << RTC_ALMA_SECL_Pos) | ((uint32_t)pstcAlarmTime->u8AlarmMinute << RTC_ALMA_MINL_Pos)
                   | ((uint32_t)u32Hour << RTC_ALMA_HOURL_Pos) | ((uint32_t)pstcAlarmTime->u8AlarmDayOfWeek << RTC_ALMA_WEEK_Pos)
                   | ((uint32_t)pstcAlarmTime->bAlarmMskSecond << RTC_ALMA_MSKS_Pos) | ((uint32_t)pstcAlarmTime->bAlarmMskMinute << RTC_ALMA_MSKM_Pos)
                   | ((uint32_t)pstcAlarmTime->bAlarmMskHour << RTC_ALMA_MSKH_Pos));

    if (RTC_ALM_CHA == u32AlarmX)
    {
        CLR_REG32_BIT(RTC->CR2, RTC_CR2_ALMAE_Msk); /* 闹钟禁止以后再设置闹钟时间 */
        WRITE_REG32(RTC->ALMA, u32RegValue);
    }
    else
    {
        CLR_REG32_BIT(RTC->CR2, RTC_CR2_ALMBE_Msk); /* 闹钟禁止以后再设置闹钟时间 */
        WRITE_REG32(RTC->ALMB, u32RegValue);
    }

    return Ok;
}

/**
 * @brief  RTC唤醒定时器使能
 * @retval None
 */
void RTC_WakeupTimerEnable(void)
{
    SET_REG32_BIT(RTC->CR2, RTC_CR2_WUTE_Msk);
}

/**
 * @brief  RTC唤醒定时器禁止
 * @retval None
 */
void RTC_WakeupTimerDisable(void)
{
    CLR_REG32_BIT(RTC->CR2, RTC_CR2_WUTE_Msk);
}

/**
 * @brief  RTC唤醒定时器时钟选择
 * @param  [in] u32Wucksel  @ref RTC_Wakeup_Timer_Clock_Select
 * @retval None
 */
void RTC_WakeupTimerClockSelect(uint32_t u32Wucksel)
{
    MODIFY_REG32(RTC->CR2, RTC_CR2_WUCKSEL_Msk, u32Wucksel);
}

/**
 * @brief  RTC唤醒定时器设置周期值
 * @param  [in] u16Cycle RTC唤醒定时器周期值 输入范围: 1~65536
 * @retval None
 */
void RTC_WakeupTimerCycleSet(uint32_t u32Cycle)
{
    MODIFY_REG32(RTC->WUTR, RTC_WUTR_ARR_Msk, (u32Cycle - 1u) << RTC_WUTR_ARR_Pos);
}

/**
 * @brief  RTC唤醒定时器获取周期值
 * @retval uint16_t RTC唤醒定时器周期值
 */
uint32_t RTC_WakeupTimerCycleGet(void)
{
    return READ_REG32(RTC->WUTR);
}

/**
 * @brief  RTC时间戳使能
 * @retval None
 */
void RTC_TimestampEnable(void)
{
    SET_REG32_BIT(RTC->CR2, RTC_CR2_TSE_Msk);
}

/**
 * @brief  RTC时间戳禁止
 * @retval None
 */
void RTC_TimestampDisable(void)
{
    CLR_REG32_BIT(RTC->CR2, RTC_CR2_TSE_Msk);
}

/**
 * @brief  RTC时间戳边沿选择
 * @param  [in] u32Edge RTC时间戳边沿选择 @ref RTC_Time_Stamp_Edge_Select
 * @retval None
 */
void RTC_TimestampEdgeSelect(uint32_t u32Edge)
{
    MODIFY_REG32(RTC->CR2, RTC_CR2_TSEDG_Msk, u32Edge);
}

/**
 * @brief  RTC时间戳时间读取
 * @param  [in] pstcTs RTC时间戳读取指针 @ref stc_rtc_ts_t
 * @retval None
 */
void RTC_TimestampGet(stc_rtc_ts_t *pstcTs)
{
    uint8_t u8Hour;

    pstcTs->u8Second    = (uint8_t)((RTC->TSTR & (RTC_TSTR_SECL_Msk | RTC_TSTR_SECH_Msk)) >> RTC_TSTR_SECL_Pos);
    pstcTs->u8Minute    = (uint8_t)((RTC->TSTR & (RTC_TSTR_MINL_Msk | RTC_TSTR_MINH_Msk)) >> RTC_TSTR_MINL_Pos);
    u8Hour              = (uint8_t)((RTC->TSTR & (RTC_TSTR_HOURL_Msk | RTC_TSTR_HOURH_Msk)) >> RTC_TSTR_HOURL_Pos);
    pstcTs->u8DayOfWeek = (uint8_t)((RTC->TSDR & RTC_TSDR_WEEK_Msk) >> RTC_TSDR_WEEK_Pos);
    pstcTs->u8Day       = (uint8_t)((RTC->TSDR & (RTC_TSDR_DAYL_Msk | RTC_TSDR_DAYH_Msk)) >> RTC_TSDR_DAYL_Pos);
    pstcTs->u8Month     = (uint8_t)((RTC->TSDR & RTC_TSDR_MON_Msk) >> RTC_TSDR_MON_Pos);

    if (RTC_FMT_24H == READ_REG32_BIT(RTC->CR0, RTC_CR0_AMPM_Msk))
    {
        pstcTs->u8Hour = u8Hour;
    }
    else
    {
        pstcTs->u8Hour = u8Hour & 0x1Fu;
        pstcTs->u8AmPm = (u8Hour & 0x20u) ? 1u : 0u;
    }
}

/**
 * @brief  RTC读取中断标志
 * @param  [in] u32IntFlag RTC中断标记 @ref RTC_Flag_Select
 * @retval boolean_t
 *           - TRUE: 中断标志置位
 *           - FALSE: 中断标志未置位
 */
boolean_t RTC_IntFlagGet(uint32_t u32IntFlag)
{
    return READ_REG32_BIT(RTC->IFR, u32IntFlag) ? TRUE : FALSE;
}

/**
 * @brief  RTC清除中断标志
 * @param  [in] u32IntFlag RTC中断标志 @ref RTC_Flag_Select
 * @retval None
 */
void RTC_IntFlagClear(uint32_t u32IntFlag)
{
    CLR_REG32_BIT(RTC->ICR, u32IntFlag);
}

/**
 * @brief  RTC中断使能
 * @param  [in] u32IntFlag RTC中断标记 @ref RTC_Int_Select
 * @retval None
 */
void RTC_IntEnable(uint32_t u32IntFlag)
{
    SET_REG32_BIT(RTC->IER, u32IntFlag);
}

/**
 * @brief  RTC中断禁用
 * @param  [in] u32IntFlag RTC中断标记 @ref RTC_Int_Select
 * @retval None
 */
void RTC_IntDisable(uint32_t u32IntFlag)
{
    CLR_REG32_BIT(RTC->IER, u32IntFlag);
}

/**
 * @brief  计算RTC误差补偿寄存器的值
 * @param  [in] f32CompUint: 补偿目标值，单位ppm
 * @param  [in] u16Csteps: 补偿精度选择 @ref RTC_Compen_Pricision_Select
 * @param  [out] pu16CompValue: 计算结果
 * @retval en_result_t
 *           - Ok: 计算成功
 *           - ErrorInvalidParameter: 参数错误
 */
en_result_t RTC_CompValueCalculate(float32_t f32CompUint, uint16_t u16Csteps, uint16_t *pu16CompValue)
{
    uint16_t  u16Res  = 0;
    float32_t f32Temp = f32CompUint;

    /* 根据 u16Csteps 选择补偿精度 */
    if (u16Csteps == RTC_COMPEN_PRICISION_0P96PPM)
    {
        if ((f32CompUint < -274.66) || (f32CompUint > 212.67))
        {
            return ErrorInvalidParameter;
        }

        if (f32CompUint > -31.47125)
        {
            CLR_REG32_BIT(RTC->COMPEN, RTC_COMPEN_CSTEPS_Msk);
            f32Temp = 32 + (f32Temp / 0.9536743f);
            f32Temp = roundf(f32Temp);   /* 四舍五入 */
            u16Res  = (uint16_t)f32Temp; /* 仅保留低9位 */
            u16Res &= 0x1FFu;
        }
        else
        {
            CLR_REG32_BIT(RTC->COMPEN, RTC_COMPEN_CSTEPS_Msk);
            f32Temp = 512 + ((f32Temp + 32 * 0.9536743f) / 0.9536743f);
            f32Temp = roundf(f32Temp);   /* 四舍五入 */
            u16Res  = (uint16_t)f32Temp; /* 仅保留低9位 */
            u16Res &= 0x1FFu;
        }
    }

    else if (u16Csteps == RTC_COMPEN_PRICISION_0P06PPM)
    {
        if ((f32CompUint < -274.66) || (f32CompUint > 213.57))
        {
            return ErrorInvalidParameter;
        }

