ZeroZap/xhsc/HC32L021/driver/src/hc32l021_rtc.c
        if (f32CompUint > -30.51758)
        {
            SET_REG32_BIT(RTC->COMPEN, RTC_COMPEN_CSTEPS_Msk);
            f32Temp = 512 + (f32Temp / 0.0596046f);
            f32Temp = roundf(f32Temp);   /* 四舍五入 */
            u16Res  = (uint16_t)f32Temp; /* 仅保留低13位 */
            u16Res &= 0x1FFFu;
        }
        else
        {
            SET_REG32_BIT(RTC->COMPEN, RTC_COMPEN_CSTEPS_Msk);
            f32Temp = 8192 + ((f32Temp + 512 * 0.0596046f) / 0.0596046f);
            f32Temp = roundf(f32Temp);   /* 四舍五入 */
            u16Res  = (uint16_t)f32Temp; /* 仅保留低13位 */
            u16Res &= 0x1FFFu;
        }
    }

    else
    {
        return ErrorInvalidParameter;
    }

    *pu16CompValue = u16Res;

    return Ok;
}

/**
 * @brief  配置RTC的误差补偿寄存器
 * @param  [in] u16CompValue 对于0.96ppm精度：范围为0-511（即0x1FF）；对于0.06ppm精度：范围为0-8191（即0x1FFF）
 * @param  [in] u16Csteps 补偿精度选择 @ref RTC_Compen_Pricision_Select
 * @retval en_result_t
 *           - Ok: 设置成功
 *           - ErrorInvalidParameter: 参数错误
 */
en_result_t RTC_CompConfig(uint16_t u16CompValue, uint16_t u16Csteps)
{
    if (u16Csteps == RTC_COMPEN_PRICISION_0P96PPM)
    {
        if (u16CompValue > 0x1FFu)
        {
            return ErrorInvalidParameter;
        }

        MODIFY_REG32(RTC->COMPEN, RTC_COMPEN_CR_Msk, (uint32_t)u16CompValue << RTC_COMPEN_CR_Pos);
    }

    else if (u16Csteps == RTC_COMPEN_PRICISION_0P06PPM)
    {
        if (u16CompValue > 0x1FFFu)
        {
            return ErrorInvalidParameter;
        }

        MODIFY_REG32(RTC->COMPEN, RTC_COMPEN_CR_Msk, (uint32_t)u16CompValue << RTC_COMPEN_CR_Pos);
    }
    else
    {
        return ErrorInvalidParameter;
    }

    return Ok;
}

/**
 * @brief  配置RTC的高速补偿精度参数
 * @param  [in] u32Hcomppara 补偿频率MHz @ref RTC_Hcomp_Parameter_Select
 * @note   0.06ppm补偿精度 建议配置补偿频率为32.768k的整数倍，范围为16-48M
 * @note   0.96ppm补偿精度 建议配置补偿频率为32.768k的整数倍，范围为4-48M
 * @retval en_result_t
 *           - Ok: 设置成功
 *           - ErrorInvalidParameter: 参数错误
 */
en_result_t RTC_HcompConfig(uint32_t u32Hcomppara)
{
    if (u32Hcomppara > 0x2Eu)
    {
        return ErrorInvalidParameter;
    }

    MODIFY_REG32(RTC->HCOMP, RTC_HCOMP_PARA_Msk, (uint32_t)u32Hcomppara);

    return Ok;
}

/**
 * @brief  RTC时间误差补偿使能
 * @retval None
 */
void RTC_CompEnable(void)
{
    SET_REG32_BIT(RTC->COMPEN, RTC_COMPEN_EN_Msk);
}

/**
 * @brief  RTC时间误差补偿禁止
 * @retval None
 */
void RTC_CompDisable(void)
{
    CLR_REG32_BIT(RTC->COMPEN, RTC_COMPEN_EN_Msk);
}

/**
 * @brief  RTC获取时间
 * @param  [in] pstcDateTime 用于存放读取日期时间的指针 @ref stc_rtc_time_t
 * @retval int32_t
 *           - Ok: 获取正常
 *           - ErrorTimeout: 超时错误
 */
en_result_t RTC_DateTimeRead(stc_rtc_time_t *pstcDateTime)
{
    uint32_t u32Timeout;

    if (READ_REG32_BIT(RTC->CR0, RTC_CR0_START_Msk))
    {
        SET_REG32_BIT(RTC->CR1, RTC_CR1_WAIT_Msk);

        u32Timeout = RTC_TIMEOUT;
        while (RTC_CR1_WAITF_Msk != READ_REG32_BIT(RTC->CR1, RTC_CR1_WAITF_Msk))
        {
            if (0x0u == u32Timeout--)
            {
                return ErrorTimeout; /* 等待超时 */
            }
        }
    }

    pstcDateTime->u8Second = (uint8_t)RTC->SEC;
    pstcDateTime->u8Minute = (uint8_t)RTC->MIN;
    if (READ_REG32_BIT(RTC->CR0, RTC_CR0_AMPM_Msk))
    {
        pstcDateTime->u8Hour = (uint8_t)RTC->HOUR;
    }
    else
    {
        pstcDateTime->u8Hour = (uint8_t)RTC->HOUR & 0x1Fu;
        pstcDateTime->u8AmPm = ((RTC->HOUR & 0x20u) ? 1u : 0u);
    }
    pstcDateTime->u8Day       = (uint8_t)RTC->DAY;
    pstcDateTime->u8DayOfWeek = (uint8_t)RTC->WEEK;
    pstcDateTime->u8Month     = (uint8_t)RTC->MON;
    pstcDateTime->u8Year      = (uint8_t)RTC->YEAR;

    CLR_REG32_BIT(RTC->CR1, RTC_CR1_WAIT_Msk);

    u32Timeout = RTC_TIMEOUT;
    if (READ_REG32_BIT(RTC->CR0, RTC_CR0_START_Msk))
    {
        while (RTC_CR1_WAITF_Msk == READ_REG32_BIT(RTC->CR1, RTC_CR1_WAITF_Msk))
        {
            if (0x0u == u32Timeout--)
            {
                return ErrorTimeout; /* 等待超时 */
            }
        }
    }

    return Ok;
}

/**
 * @brief  向RTC时间寄存器写入时间
 * @param  [in] pstcDateTime 用于存放读取日期时间的指针 @ref stc_rtc_time_t
 * @retval en_result_t
 *           - Ok: 写入正常
 *           - ErrorInvalidParameter: 参数错误
 *           - ErrorTimeout: 时间溢出错误
 */
en_result_t RTC_DateTimeSet(stc_rtc_time_t *pstcDateTime)
{
    en_result_t enRet = Ok;
    uint32_t    u32Timeout;
    uint8_t     u8MonthIndex;

    if (Ok != RTC_CheckBCDFormat(pstcDateTime->u8Second, 0x00u, 0x59u))
    {
        return ErrorInvalidParameter;
    }
    if (Ok != RTC_CheckBCDFormat(pstcDateTime->u8Minute, 0x00u, 0x59u))
    {
        return ErrorInvalidParameter;
    }
    if (Ok != RTC_CheckBCDFormat(pstcDateTime->u8Month, 0x01u, 0x12u))
    {
        return ErrorInvalidParameter;
    }
    if (Ok != RTC_CheckBCDFormat(pstcDateTime->u8Year, 0x00u, 0x99u))
    {
        return ErrorInvalidParameter;
    }
    if (Ok != RTC_CheckBCDFormat(pstcDateTime->u8DayOfWeek, 0x00u, 0x06u))
    {
        return ErrorInvalidParameter;
    }
    u8MonthIndex = ((pstcDateTime->u8Month & 0x10U) ? 10u : 0u) + (pstcDateTime->u8Month & 0x0Fu) - 1u;
    if (pstcDateTime->u8Month == 0x02u)
    {
        if (RTC_IsLeapYear(pstcDateTime->u8Year))
        {
            enRet = RTC_CheckBCDFormat(pstcDateTime->u8Day, 0x01u, 0x29u); /*!< 闰年2月 */
        }
        else
        {
            enRet = RTC_CheckBCDFormat(pstcDateTime->u8Day, 0x01u, 0x28u); /*!< 平年2月 */
        }
    }
    else
    {
        enRet = RTC_CheckBCDFormat(pstcDateTime->u8Day, 0x01u, au8CommonYearMonthEndDates[u8MonthIndex]);
    }
    if (Ok != enRet)
    {
        return ErrorInvalidParameter;
    }
    if (RTC_FMT_24H == READ_REG32_BIT(RTC->CR0, RTC_CR0_AMPM_Msk))
    {
        enRet = RTC_CheckBCDFormat(pstcDateTime->u8Hour, 0x00u, 0x23u); /*!< 24H */
    }
    else
    {
        enRet = RTC_CheckBCDFormat(pstcDateTime->u8Hour & (~0x20u), 0x01u, 0x12u); /*!< 12H */
    }
    if (Ok != enRet)
    {
        return ErrorInvalidParameter;
    }

    if (READ_REG32_BIT(RTC->CR0, RTC_CR0_START_Msk))
    {
        SET_REG32_BIT(RTC->CR1, RTC_CR1_WAIT_Msk);
        u32Timeout = RTC_TIMEOUT;
        while (RTC_CR1_WAITF_Msk != READ_REG32_BIT(RTC->CR1, RTC_CR1_WAITF_Msk))
        {
            if (0x0u == u32Timeout--)
            {
                return ErrorTimeout; /* 等待超时 */
            }
        }
    }
    WRITE_REG32(RTC->SEC, (uint32_t)pstcDateTime->u8Second);
    WRITE_REG32(RTC->MIN, (uint32_t)pstcDateTime->u8Minute);
    if (READ_REG32_BIT(RTC->CR0, RTC_CR0_AMPM_Msk))
    {
        WRITE_REG32(RTC->HOUR, (uint32_t)pstcDateTime->u8Hour); /*!< 24H */
    }
    else
    {
        WRITE_REG32(RTC->HOUR, (uint32_t)pstcDateTime->u8Hour | ((uint32_t)pstcDateTime->u8AmPm << 5u)); /*!< 12H */
    }
    WRITE_REG32(RTC->DAY, (uint32_t)pstcDateTime->u8Day);
    WRITE_REG32(RTC->MON, (uint32_t)pstcDateTime->u8Month);
    WRITE_REG32(RTC->YEAR, (uint32_t)pstcDateTime->u8Year);
    WRITE_REG32(RTC->WEEK, (uint32_t)pstcDateTime->u8DayOfWeek);

    CLR_REG32_BIT(RTC->CR1, RTC_CR1_WAIT_Msk);

    u32Timeout = RTC_TIMEOUT;
    if (READ_REG32_BIT(RTC->CR0, RTC_CR0_START_Msk))
    {
        while (RTC_CR1_WAITF_Msk == READ_REG32_BIT(RTC->CR1, RTC_CR1_WAITF_Msk))
        {
            if (0x0u == u32Timeout--)
            {
                return ErrorTimeout; /* 等待超时 */
            }
        }
    }

