ZeroZap/xhsc/HC32L021/driver/src/hc32l021_rtc.c
    enRet = Ok;
    return enRet;
}

/**
 * @brief  读取RTC当前的时间格式
 * @retval en_result_t
 *           - TRUE: 24小时制
 *           - FALSE: 12小时制
 */
boolean_t RTC_FormatGet(void)
{
    return READ_REG32_BIT(RTC->CR0, RTC_CR0_AMPM_Msk) ? TRUE : FALSE;
}

/**
 * @brief  RTC配置结构体初始化
 * @retval None
 */
void RTC_RtcStcInit(stc_rtc_init_t *pstcInit)
{
    pstcInit->u32ClockSelect         = RTC_CLK_XTL;
    pstcInit->u8Format               = RTC_FMT_12H;
    pstcInit->stcRtcTime.u8Second    = 0x0u;
    pstcInit->stcRtcTime.u8Minute    = 0x0u;
    pstcInit->stcRtcTime.u8Hour      = 0x1u;
    pstcInit->stcRtcTime.u8Day       = 0x1u;
    pstcInit->stcRtcTime.u8DayOfWeek = 0x0u;
    pstcInit->stcRtcTime.u8Month     = 0x1u;
    pstcInit->stcRtcTime.u8Year      = 0x0u;
}

/**
 * @brief  RTC中断周期类型配置结构体初始化
 * @retval None
 */
void RTC_PrdStcInit(stc_rtc_prd_t *pstcInit)
{
    pstcInit->u32PrdSelect = RTC_PRDSEL_PRDS;
    pstcInit->u32Prds      = RTC_PRDS_NONE;
    pstcInit->u8Prdx       = 0x0u;
}

/**
 * @brief  RTC闹钟时间配置结构体初始化
 * @param  [in] pstcInit 初始化结构体 @ref stc_rtc_init_t
 * @retval None
 */
void RTC_AlarmStcInit(stc_rtc_alarmtime_t *pstcInit)
{
    pstcInit->u8AmPm           = RTC_AMPM_AM;
    pstcInit->u8AlarmSecond    = 0x0u;
    pstcInit->bAlarmMskSecond  = FALSE;
    pstcInit->u8AlarmMinute    = 0x0u;
    pstcInit->bAlarmMskMinute  = FALSE;
    pstcInit->u8AlarmHour      = 0x0u;
    pstcInit->bAlarmMskHour    = FALSE;
    pstcInit->u8AlarmDayOfWeek = RTC_ALMWEEK_NONE;
}
/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
